profiling/stage_2/get_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.863ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.390ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.864ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.287ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.89ms    0.97ms  18.42ms   76.50%
    Req/Sec    26.20k     3.54k   54.67k    78.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.75ms
 75.000%    2.34ms
 90.000%    2.97ms
 99.000%    5.36ms
 99.900%    8.45ms
 99.990%   12.89ms
 99.999%   15.48ms
100.000%   18.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.052     0.000000            1         1.00
       0.865     0.100000       186386         1.11
       1.125     0.200000       372539         1.25
       1.345     0.300000       558563         1.43
       1.545     0.400000       743873         1.67
       1.749     0.500000       929825         2.00
       1.855     0.550000      1022976         2.22
       1.966     0.600000      1116002         2.50
       2.083     0.650000      1209713         2.86
       2.205     0.700000      1301592         3.33
       2.339     0.750000      1394443         4.00
       2.415     0.775000      1441571         4.44
       2.497     0.800000      1487906         5.00
       2.589     0.825000      1534301         5.71
       2.695     0.850000      1580923         6.67
       2.819     0.875000      1627299         8.00
       2.891     0.887500      1650295         8.89
       2.973     0.900000      1673201        10.00
       3.067     0.912500      1696502        11.43
       3.175     0.925000      1719960        13.33
       3.305     0.937500      1743156        16.00
       3.383     0.943750      1754558        17.78
       3.479     0.950000      1766287        20.00
       3.591     0.956250      1777806        22.86
       3.731     0.962500      1789511        26.67
       3.915     0.968750      1801104        32.00
       4.031     0.971875      1806823        35.56
       4.167     0.975000      1812708        40.00
       4.327     0.978125      1818579        45.71
       4.519     0.981250      1824260        53.33
       4.759     0.984375      1830107        64.00
       4.903     0.985938      1832972        71.11
       5.063     0.987500      1835881        80.00
       5.239     0.989062      1838774        91.43
       5.443     0.990625      1841716       106.67
       5.679     0.992188      1844617       128.00
       5.811     0.992969      1846072       142.22
       5.967     0.993750      1847511       160.00
       6.135     0.994531      1848967       182.86
       6.323     0.995313      1850404       213.33
       6.551     0.996094      1851868       256.00
       6.683     0.996484      1852583       284.44
       6.839     0.996875      1853302       320.00
       7.023     0.997266      1854032       365.71
       7.231     0.997656      1854750       426.67
       7.475     0.998047      1855486       512.00
       7.619     0.998242      1855842       568.89
       7.791     0.998437      1856206       640.00
       7.987     0.998633      1856571       731.43
       8.207     0.998828      1856930       853.33
       8.495     0.999023      1857298      1024.00
       8.679     0.999121      1857477      1137.78
       8.895     0.999219      1857660      1280.00
       9.111     0.999316      1857841      1462.86
       9.351     0.999414      1858020      1706.67
       9.671     0.999512      1858203      2048.00
       9.847     0.999561      1858292      2275.56
      10.023     0.999609      1858383      2560.00
      10.223     0.999658      1858473      2925.71
      10.447     0.999707      1858566      3413.33
      10.767     0.999756      1858654      4096.00
      10.983     0.999780      1858699      4551.11
      11.215     0.999805      1858745      5120.00
      11.583     0.999829      1858790      5851.43
      12.015     0.999854      1858835      6826.67
      12.511     0.999878      1858881      8192.00
      12.767     0.999890      1858903      9102.22
      12.919     0.999902      1858928     10240.00
      13.103     0.999915      1858949     11702.86
      13.271     0.999927      1858971     13653.33
      13.783     0.999939      1858994     16384.00
      13.927     0.999945      1859005     18204.44
      14.095     0.999951      1859017     20480.00
      14.343     0.999957      1859028     23405.71
      14.503     0.999963      1859040     27306.67
      14.679     0.999969      1859052     32768.00
      14.735     0.999973      1859056     36408.89
      14.775     0.999976      1859062     40960.00
      14.863     0.999979      1859068     46811.43
      14.895     0.999982      1859073     54613.33
      15.063     0.999985      1859079     65536.00
      15.199     0.999986      1859082     72817.78
      15.295     0.999988      1859085     81920.00
      15.479     0.999989      1859088     93622.86
      15.583     0.999991      1859090    109226.67
      15.799     0.999992      1859093    131072.00
      15.911     0.999993      1859095    145635.56
      15.991     0.999994      1859096    163840.00
      16.375     0.999995      1859098    187245.71
      16.431     0.999995      1859099    218453.33
      16.479     0.999996      1859100    262144.00
      16.511     0.999997      1859101    291271.11
      16.527     0.999997      1859102    327680.00
      16.607     0.999997      1859103    374491.43
      16.607     0.999998      1859103    436906.67
      16.735     0.999998      1859104    524288.00
      16.735     0.999998      1859104    582542.22
      16.879     0.999998      1859105    655360.00
      16.879     0.999999      1859105    748982.86
      16.879     0.999999      1859105    873813.33
      18.223     0.999999      1859106   1048576.00
      18.223     0.999999      1859106   1165084.44
      18.223     0.999999      1859106   1310720.00
      18.223     0.999999      1859106   1497965.71
      18.223     0.999999      1859106   1747626.67
      18.431     1.000000      1859107   2097152.00
      18.431     1.000000      1859107          inf
#[Mean    =        1.888, StdDeviation   =        0.971]
#[Max     =       18.416, Total count    =      1859107]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2896757 requests in 30.00s, 187.43MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
Requests/sec:  96556.28
Transfer/sec:      6.25MB