profiling/stage_2/put_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 108.018ms, rate sampling interval: 580ms
  Thread calibration: mean lat.: 207.120ms, rate sampling interval: 1153ms
  Thread calibration: mean lat.: 230.237ms, rate sampling interval: 1021ms
  Thread calibration: mean lat.: 96.934ms, rate sampling interval: 526ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.60ms   14.82ms 204.03ms   88.43%
    Req/Sec    24.87k   738.17    27.77k    86.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.53ms
 75.000%   20.05ms
 90.000%   31.92ms
 99.000%   76.54ms
 99.900%  122.50ms
 99.990%  162.69ms
 99.999%  188.29ms
100.000%  204.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.102     0.000000            1         1.00
       3.079     0.100000       185928         1.11
       5.247     0.200000       372035         1.25
       7.179     0.300000       557614         1.43
       9.231     0.400000       743683         1.67
      11.535     0.500000       929479         2.00
      12.823     0.550000      1022695         2.22
      14.247     0.600000      1115077         2.50
      15.903     0.650000      1208254         2.86
      17.791     0.700000      1301043         3.33
      20.047     0.750000      1394262         4.00
      21.311     0.775000      1440390         4.44
      22.719     0.800000      1486913         5.00
      24.351     0.825000      1533232         5.71
      26.303     0.850000      1579981         6.67
      28.735     0.875000      1626264         8.00
      30.207     0.887500      1649459         8.89
      31.919     0.900000      1672665        10.00
      33.887     0.912500      1695912        11.43
      36.191     0.925000      1719395        13.33
      38.911     0.937500      1742382        16.00
      40.639     0.943750      1754040        17.78
      42.591     0.950000      1765699        20.00
      44.863     0.956250      1777237        22.86
      47.583     0.962500      1788807        26.67
      51.007     0.968750      1800462        32.00
      53.151     0.971875      1806191        35.56
      55.583     0.975000      1812048        40.00
      58.399     0.978125      1817805        45.71
      61.727     0.981250      1823647        53.33
      66.047     0.984375      1829421        64.00
      68.607     0.985938      1832382        71.11
      71.359     0.987500      1835230        80.00
      74.367     0.989062      1838149        91.43
      78.015     0.990625      1841045       106.67
      81.919     0.992188      1843967       128.00
      84.031     0.992969      1845403       142.22
      86.463     0.993750      1846860       160.00
      89.343     0.994531      1848302       182.86
      92.607     0.995313      1849766       213.33
      96.767     0.996094      1851211       256.00
      99.263     0.996484      1851935       284.44
     101.887     0.996875      1852663       320.00
     104.319     0.997266      1853378       365.71
     107.327     0.997656      1854112       426.67
     110.463     0.998047      1854840       512.00
     112.447     0.998242      1855198       568.89
     114.623     0.998437      1855555       640.00
     116.863     0.998633      1855922       731.43
     119.359     0.998828      1856289       853.33
     122.943     0.999023      1856645      1024.00
     124.927     0.999121      1856825      1137.78
     126.783     0.999219      1857007      1280.00
     129.023     0.999316      1857190      1462.86
     132.223     0.999414      1857373      1706.67
     135.167     0.999512      1857552      2048.00
     136.831     0.999561      1857647      2275.56
     138.751     0.999609      1857734      2560.00
     140.799     0.999658      1857832      2925.71
     142.975     0.999707      1857914      3413.33
     146.047     0.999756      1858006      4096.00
     148.223     0.999780      1858050      4551.11
     150.399     0.999805      1858097      5120.00
     153.087     0.999829      1858141      5851.43
     156.415     0.999854      1858187      6826.67
     160.127     0.999878      1858234      8192.00
     161.407     0.999890      1858254      9102.22
     162.815     0.999902      1858278     10240.00
     164.479     0.999915      1858299     11702.86
     166.911     0.999927      1858321     13653.33
     169.727     0.999939      1858344     16384.00
     171.007     0.999945      1858355     18204.44
     172.287     0.999951      1858367     20480.00
     174.463     0.999957      1858378     23405.71
     175.999     0.999963      1858389     27306.67
     179.071     0.999969      1858401     32768.00
     179.967     0.999973      1858406     36408.89
     181.247     0.999976      1858413     40960.00
     181.887     0.999979      1858418     46811.43
     182.271     0.999982      1858423     54613.33
     184.319     0.999985      1858429     65536.00
     185.727     0.999986      1858432     72817.78
     186.495     0.999988      1858435     81920.00
     188.287     0.999989      1858438     93622.86
     188.671     0.999991      1858440    109226.67
     189.567     0.999992      1858443    131072.00
     190.079     0.999993      1858445    145635.56
     190.591     0.999994      1858446    163840.00
     192.127     0.999995      1858448    187245.71
     193.279     0.999995      1858449    218453.33
     194.303     0.999996      1858450    262144.00
     195.455     0.999997      1858451    291271.11
     199.679     0.999997      1858452    327680.00
     200.063     0.999997      1858453    374491.43
     200.063     0.999998      1858453    436906.67
     201.471     0.999998      1858454    524288.00
     201.471     0.999998      1858454    582542.22
     203.007     0.999998      1858455    655360.00
     203.007     0.999999      1858455    748982.86
     203.007     0.999999      1858455    873813.33
     204.159     0.999999      1858457   1048576.00
     204.159     1.000000      1858457          inf
#[Mean    =       15.596, StdDeviation   =       14.821]
#[Max     =      204.032, Total count    =      1858457]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2894481 requests in 30.00s, 184.95MB read
  Socket errors: connect 7, read 0, write 0, timeout 98
Requests/sec:  96481.65
Transfer/sec:      6.16MB